{
  "name": "Zelta Live",
  "version": "Beta 1.0.1",
  "downloadUrl": "https://github.com/MineHighVN/zeltalive-notify/releases/download/v1.0.1/Zelta.Live_1.0.1_x64-setup.exe",
  "versionCode": 8,
  "style": {
    "login_background": "https://raw.githubusercontent.com/MineHighVN/zeltalive-notify/refs/heads/main/images/250425-30-th4-1975.png"
  },
  "notify": [
    {
      "title": "Announcement from Zelta Live",
      "data": "Mojang has just updated Minecraft to version 1.21.90, which caused some issues preventing Zelta Live from connecting to worlds properly. I've resolved that issue, but there are still a few important things to note:\n\nCurrently, I'm in the process of updating Zelta Live's backend system to a new version, aimed at testing and preparing for upcoming features such as livestreaming, in-game shop, and user sync with Discord.\n\nTo support this process, I had to restructure the system, which unfortunately breaks full compatibility with the previous version. However, the new version now supports backward-compatible user experience, even when the system is updated, by introducing versioned APIs (/api/v1/... instead of /api/...).\n\nSince this is still an experimental phase, I can't yet guarantee that the old and new versions will work smoothly together. As a result, some features will be temporarily hidden or limited to ensure the safety of the system and your data.\n\nI hope you understand during this transition period, and thank you so much for always supporting Zelta Live. If you encounter any issues during use, please report them so I can address them promptly.\n\nThe upgrade to the new version will take approximately 5 to 7 days. During this time, please play on a Minecraft version lower than 1.21.90."
    },
    {
      "title": "Celebrating the 50th Anniversary of the Liberation of South Vietnam",
      "data": "April 30th marks a historic milestone, remembering the glorious victory of the Vietnamese people in their journey to regain independence and national reunification.\nOn the occasion of the 50th anniversary, we look back to our roots and honor the heroes who sacrificed for the independence – freedom of our nation.\n\nThis is not only a time for pride, but also an opportunity for today's generation to continue and promote the tradition of patriotism, building a country that is increasingly prosperous and civilized."
    }
  ]
}
